app/views/groups/_form.html.erb

        <%= f.label 'Group Type' %>
        <%= select(:group, :group_type, Group.group_types)%>
---
SELECT "groups".* FROM "groups"