app/controllers/day_availabilities_controller.rb

  def index
    @day_availabilities = DayAvailability.all
---
SELECT "day_availabilities".* FROM "day_availabilities"