app/controllers/groups_controller.rb

	def index
		@groups = Group.all
---
SELECT "groups".* FROM "groups"