app/controllers/home_controller.rb

SELECT "locations".* FROM "locations"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def index
    @locations = Location.all
    @json = Location.all.to_gmaps4rails do |loc, marker|
      user = User.find(loc.user_id)