app/controllers/search_controller.rb

  def index
    @rates = Array.new
    @tutors = Array.new

    @courses = Hash.new

    @users = User.all
---
SELECT "users".* FROM "users"